''' 25 - 03 - 31 강의 자료 '''

'''
변수(Variable)
'''

### 여러 값으로 구성된 변수 만들기
var1 = [1,2,3] # list(리스트) : 대괄호 안에 여러 가지 값을 입력해서 생성하는 형태
var2 = [4,5,6]

# print(var1)
# print(var2)
#
# print(var1 + var2)
'''
리스트의 연산은 리스트를 합쳐(연결시켜)준다.

주석 단축기 : Ctrl + ?
'''

### 문자 변수 생성
str1 = 'a'
# print(str1)

str2 = 'text'
# print(str2)

str2_2 = '13' # 따옴표 안에 들어간 숫자는 문자로써 기능을 한다.
# print(str2_2)

str3 = 'Hello World !'
str4 = ['a', 'b', 'c']
str5 = ['Hello!', 'World', 'is', 'good']

# 문자 변수 결합
# print(str2 + str3) # 문자열 더하기 연산은 문자열을 연결시켜준다.
str6 = '100'
# print(str2_2 + str6)

# -----------------------------------------------------------------------------------------------------
''' 함수(function) : 입력을 받아서 출력을 내주는 수

- 값을 넣으면 특정한 기능을 수행해서 처음과 다른 값을 만드는 수
- 괄호 안에 입력을 받는다.

print()
'''

### 함수 이용하기
x = [1, 2, 3]
# print(sum(x)) # sum() : 합계 함수
# print(max(x)) # max() : 최댓값

## 함수의 결과물로 새 변수 만들어서 활용한다. ***
x_sum = sum(x)
print(x_sum)









